NguyenPhiHao/RL78F25/Sample_App_Lin/QINeS_MCAL/src/Product_depend/F24/CCRL/Mcal/Platform/include/Mcl_70_RL78F2X.h
/******************************************************************************/
/* Copyright   :                                                              */
/* System Name : AUTOSAR MCAL                                                 */
/* File Name   : Mcl_70_RL78F2X.h                                             */
/* Version     : v1.00.02                                                     */
/* Contents    : Macros to manipulate RL78F2X I/O controllers                 */
/* Author      : --                                                           */
/* Note        : --                                                           */
/* History     : --                                                           */
/******************************************************************************/

#ifndef MCL_70_RL78F2X_H_
#define MCL_70_RL78F2X_H_

/*----------------------------------------------------------------------------*/
/* include headers                                                            */
/*----------------------------------------------------------------------------*/
#include "Std_Types.h"
#include "QINeS_Lite.h"

/*----------------------------------------------------------------------------*/
/* file version information                                                   */
/*----------------------------------------------------------------------------*/
#define MCL_70_VENDOR_ID_RL78F2X_H (70U)
#define MCL_70_MODULE_ID_RL78F2X_H (0U)

#define MCL_70_AR_RELEASE_MAJOR_VERSION_RL78F2X_H (22U)
#define MCL_70_AR_RELEASE_MINOR_VERSION_RL78F2X_H (11U)
#define MCL_70_AR_RELEASE_REVISION_VERSION_RL78F2X_H (0U)

#define MCL_70_SW_MAJOR_VERSION_RL78F2X_H (1U)
#define MCL_70_SW_MINOR_VERSION_RL78F2X_H (0U)
#define MCL_70_SW_PATCH_VERSION_RL78F2X_H (0U)

/*----------------------------------------------------------------------------*/
/* file version information                                                   */
/*----------------------------------------------------------------------------*/
#define MCL_70_HW_VERSION_RL78F2X_F24 (1U)
#define MCL_70_HW_VERSION_RL78F2X_F25 (2U)
#define MCL_70_HW_VERSION_RL78F2X MCL_70_HW_VERSION_RL78F2X_F25
/*----------------------------------------------------------------------------*/
/* file version checks                                                        */
/*----------------------------------------------------------------------------*/
/* Check if header file and Std types header file are of the same Autosar version */
#if ((MCL_70_AR_RELEASE_MAJOR_VERSION_RL78F2X_H != STD_TYPES_AR_RELEASE_MAJOR_VERSION) || \
     (MCL_70_AR_RELEASE_MINOR_VERSION_RL78F2X_H != STD_TYPES_AR_RELEASE_MINOR_VERSION) || \
     (MCL_70_AR_RELEASE_REVISION_VERSION_RL78F2X_H != STD_TYPES_AR_RELEASE_REVISION_VERSION))
#error "AUTOSAR Version Numbers of Mcl_70_RL78F2X.h and Std_Types.h are different"
#endif

/*----------------------------------------------------------------------------*/
/* common definitions                                                         */
/*----------------------------------------------------------------------------*/

/* types for I/O register */
typedef volatile uint32 QL_70_NEAR io32;
typedef volatile uint16 QL_70_NEAR io16;
typedef volatile uint8 QL_70_NEAR io8;

/* addres definitions for I/O register */
#define IO8(addr) ((io8 *)(addr))
#define IO16(addr) ((io16 *)(addr))
#define IO32(addr) ((io32 *)(addr))

/*----------------------------------------------------------------------------*/
/* for Mcu                                                                    */
/*----------------------------------------------------------------------------*/
#define MCL_70_RL78F2X_OSMC_REG (*(IO8(0x00F3U)))  /* OSMC */
#define MCL_70_RL78F2X_TPS0_REG (*(IO16(0x01B6U))) /* TPS0 */
#define MCL_70_RL78F2X_TPS1_REG (*(IO16(0x01F6U))) /* TPS1 */

#define MCL_70_RL78F2X_ECCIER_REG (*(IO8(0x0202U))) /* ECCIER */
#define MCL_70_RL78F2X_ECCER_REG (*(IO8(0x0203U)))  /* ECCER  */

#define MCL_70_RL78F2X_CANCKSEL_REG (*(IO8(0x02C2U))) /* CANCKSEL */
#define MCL_70_RL78F2X_LINCKSEL_REG (*(IO8(0x02C3U))) /* LINCKSEL */
#define MCL_70_RL78F2X_CKSEL_REG (*(IO8(0x02C4U)))    /* CKSEL */
#define MCL_70_RL78F2X_PLLCTL_REG (*(IO8(0x02C5U)))   /* PLLCTL */
#define MCL_70_RL78F2X_PLLSTS_REG (*(IO8(0x02C6U)))   /* PLLSTS */
#define MCL_70_RL78F2X_MDIV_REG (*(IO8(0x02C7U)))     /* MDIV */

#define MCL_70_RL78F2X_ADCKS_REG (*(IO8(0x00E0U))) /* ADCKS */

#define MCL_70_RL78F2X_PER0_REG (*(IO8(0x00F0U))) /* PER0 */
#define MCL_70_RL78F2X_PER1_REG (*(IO8(0x02C0U))) /* PER1 */
#define MCL_70_RL78F2X_PER2_REG (*(IO8(0x02C1U))) /* PER2 */

#define MCL_70_RL78F2X_CMC_REG (*(IO8(0xFFA0U)))  /* CMC */
#define MCL_70_RL78F2X_CSC_REG (*(IO8(0xFFA1U)))  /* CSC */
#define MCL_70_RL78F2X_OSTC_REG (*(IO8(0xFFA2U))) /* OSTC */
#define MCL_70_RL78F2X_OSTS_REG (*(IO8(0xFFA3U))) /* OSTS */
#define MCL_70_RL78F2X_CKC_REG (*(IO8(0xFFA4U)))  /* CKC */
#define MCL_70_RL78F2X_CKS0_REG (*(IO8(0xFFA5U))) /* CKS0 */
#define MCL_70_RL78F2X_WDTE_REG (*(IO8(0xFFABU))) /* WDTE */

#define MCL_70_RL78F2X_RESF_REG (*(IO8(0xFFA8U)))   /* RESF */
#define MCL_70_RL78F2X_POCRES_REG (*(IO8(0x02C9U))) /* POCRES */

/*----------------------------------------------------------------------------*/
/* for all timers                                                             */
/*----------------------------------------------------------------------------*/
#define MCL_70_CHANNEL_TICK_VALUE_MAX_16 (0xFFFFU) /* MAX Tick Value for 16bit timer (TAU/TRJ/TRD) */

/*----------------------------------------------------------------------------*/
/* for TAU                                                                    */
/*----------------------------------------------------------------------------*/

/* continuous address registers */
typedef struct
{
    volatile uint16 regTcr;    /* 0x0000 : TCRmn   */
    volatile uint16 dummy1[7]; /* 0x0001 - 0x000F  */
    volatile uint16 regTmr;    /* 0x0010 : TMRmn   */
    volatile uint16 dummy2[7]; /* 0x0011 - 0x001F  */
    volatile uint16 regTsr;    /* 0x0020 : TSRmn   */
} Mcl_70_RL78F2X_TAU_ContRegType;

/* fixed address registers */
typedef struct
{
    volatile uint16 regTe;  /* 0x0000 : TEm      */
    volatile uint16 regTs;  /* 0x0002 : TSm      */
    volatile uint16 regTt;  /* 0x0004 : TTm      */
    volatile uint16 dummy;  /* 0x0006 - 0x0007   */
    volatile uint16 regTo;  /* 0x0008 : TOm      */
    volatile uint16 regToe; /* 0x000A : TOEm     */
    volatile uint16 regTol; /* 0x000C : TOLm     */
    volatile uint16 regTom; /* 0x000E : TOMm     */
} Mcl_70_RL78F2X_TAU_FixRegType;

/* top address of TAU continuous address registers */
#define MCL_70_RL78F2X_TAU_TAU00_CONT_ADR (IO16(0x0180U)) /* TAU Unit0 Ch0 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU01_CONT_ADR (IO16(0x0182U)) /* TAU Unit0 Ch1 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU02_CONT_ADR (IO16(0x0184U)) /* TAU Unit0 Ch2 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU03_CONT_ADR (IO16(0x0186U)) /* TAU Unit0 Ch3 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU04_CONT_ADR (IO16(0x0188U)) /* TAU Unit0 Ch4 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU05_CONT_ADR (IO16(0x018AU)) /* TAU Unit0 Ch5 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU06_CONT_ADR (IO16(0x018CU)) /* TAU Unit0 Ch6 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU07_CONT_ADR (IO16(0x018EU)) /* TAU Unit0 Ch7 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU10_CONT_ADR (IO16(0x01c0U)) /* TAU Unit1 Ch0 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU11_CONT_ADR (IO16(0x01c2U)) /* TAU Unit1 Ch1 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU12_CONT_ADR (IO16(0x01c4U)) /* TAU Unit1 Ch2 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU13_CONT_ADR (IO16(0x01c6U)) /* TAU Unit1 Ch3 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU14_CONT_ADR (IO16(0x01c8U)) /* TAU Unit1 Ch4 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU15_CONT_ADR (IO16(0x01cAU)) /* TAU Unit1 Ch5 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU16_CONT_ADR (IO16(0x01cCU)) /* TAU Unit1 Ch6 TCRmn */
#define MCL_70_RL78F2X_TAU_TAU17_CONT_ADR (IO16(0x01cEU)) /* TAU Unit1 Ch7 TCRmn */

/* top address of TAU fixed address registers */
#define MCL_70_RL78F2X_TAU_TAU0_FIX_ADR (IO16(0x01B0U)) /* TAU Unit0 TEm */
#define MCL_70_RL78F2X_TAU_TAU1_FIX_ADR (IO16(0x01F0U)) /* TAU Unit1 TEm */

/* for TAU Unit 0 */
/* address of TDR register */
#define MCL_70_RL78F2X_TAU_TDR00_ADR (IO16(0xFF18U)) /* TAU Unit0 Ch0 TDR */
#define MCL_70_RL78F2X_TAU_TDR01_ADR (IO16(0xFF1aU)) /* TAU Unit0 Ch1 TDR */
#define MCL_70_RL78F2X_TAU_TDR02_ADR (IO16(0xFF74U)) /* TAU Unit0 Ch2 TDR */
#define MCL_70_RL78F2X_TAU_TDR03_ADR (IO16(0xFF76U)) /* TAU Unit0 Ch3 TDR */
#define MCL_70_RL78F2X_TAU_TDR04_ADR (IO16(0xFF78U)) /* TAU Unit0 Ch4 TDR */
#define MCL_70_RL78F2X_TAU_TDR05_ADR (IO16(0xFF7AU)) /* TAU Unit0 Ch5 TDR */
#define MCL_70_RL78F2X_TAU_TDR06_ADR (IO16(0xFF7CU)) /* TAU Unit0 Ch6 TDR */
#define MCL_70_RL78F2X_TAU_TDR07_ADR (IO16(0xFF7EU)) /* TAU Unit0 Ch7 TDR */

#define MCL_70_RL78F2X_TAU_NFEN1_ADR (IO8(0x0071U)) /* TAU0 NFEN1 */

#define MCL_70_RL78F2X_TIS0_REG (*(IO8(0x0074U))) /* TIS0 */

/* for TAU Unit 1 */
/* address of TDR register */
#define MCL_70_RL78F2X_TAU_TDR10_ADR (IO16(0xFF80U)) /* TAU Unit1 Ch0 TDR */
#define MCL_70_RL78F2X_TAU_TDR11_ADR (IO16(0xFF82U)) /* TAU Unit1 Ch1 TDR */
#define MCL_70_RL78F2X_TAU_TDR12_ADR (IO16(0xFF84U)) /* TAU Unit1 Ch2 TDR */
#define MCL_70_RL78F2X_TAU_TDR13_ADR (IO16(0xFF86U)) /* TAU Unit1 Ch3 TDR */
#define MCL_70_RL78F2X_TAU_TDR14_ADR (IO16(0xFF88U)) /* TAU Unit1 Ch4 TDR */
#define MCL_70_RL78F2X_TAU_TDR15_ADR (IO16(0xFF8AU)) /* TAU Unit1 Ch5 TDR */
#define MCL_70_RL78F2X_TAU_TDR16_ADR (IO16(0xFF8CU)) /* TAU Unit1 Ch6 TDR */
#define MCL_70_RL78F2X_TAU_TDR17_ADR (IO16(0xFF8EU)) /* TAU Unit1 Ch7 TDR */

#define MCL_70_RL78F2X_TAU_NFEN2_ADR (IO8(0x0072U)) /* TAU1 NFEN2 */

/* for select TAU Unit with UTSEL */
#define MCL_70_RL78F2X_TAU_UTSEL_ADR (*(IO8(0x01F0U)))  /* UTSEL */
#define MCL_70_RL78F2X_TAU_UTSEL_TSEL0_1 ((uint8)0x01U) /* select Unit1 */

