NguyenPhiHao/RL78F25/Sample_App_Lin/QINeS_MCAL/src/Product_depend/F24/CCRL/Mcal/Platform/include/Mcl_70_RL78F2X.h
/* for TAU Unit 0/1 */
/* data for TMR register */
#define MCL_70_RL78F2X_TAU_TMR_CK0 ((uint16)0x0000U)  /* select CKm0 */
#define MCL_70_RL78F2X_TAU_TMR_CK1 ((uint16)0x8000U)  /* select CKm1 */
#define MCL_70_RL78F2X_TAU_TMR_CK2 ((uint16)0x4000U)  /* select CKm2 */
#define MCL_70_RL78F2X_TAU_TMR_CK3 ((uint16)0xC000U)  /* select CKm3 */
#define MCL_70_RL78F2X_TAU_TMR_INIT ((uint16)0x0000U) /* default value */

#define MCL_70_RL78F2X_TAU_TMR_CCS0 ((uint16)0x0000U) /* select CCS = 0 */
#define MCL_70_RL78F2X_TAU_TMR_CCS1 ((uint16)0x1000U) /* select CCS = 1 */

#define MCL_70_RL78F2X_TAU_TMR_STS0 ((uint16)0x0000U) /* select STS(STSmn0 = 0,STSmn1=0,STSmn2=0) */
#define MCL_70_RL78F2X_TAU_TMR_STS1 ((uint16)0x0100U) /* select STS(STSmn0 = 1,STSmn1=0,STSmn2=0) */
#define MCL_70_RL78F2X_TAU_TMR_STS2 ((uint16)0x0200U) /* select STS(STSmn0 = 0,STSmn1=1,STSmn2=0) */
#define MCL_70_RL78F2X_TAU_TMR_STS3 ((uint16)0x0400U) /* select STS(STSmn0 = 0,STSmn1=0,STSmn2=1) */

#define MCL_70_RL78F2X_TAU_TMR_CIS0 ((uint16)0x0000U) /* select CIS(CISmn0 = 0,CISmn1=0) */
#define MCL_70_RL78F2X_TAU_TMR_CIS1 ((uint16)0x0040U) /* select CIS(CISmn0 = 0,CISmn1=0) */
#define MCL_70_RL78F2X_TAU_TMR_CIS2 ((uint16)0x0080U) /* select CIS(CISmn0 = 0,CISmn1=0) */
#define MCL_70_RL78F2X_TAU_TMR_CIS3 ((uint16)0x00C0U) /* select CIS(CISmn0 = 0,CISmn1=0) */

#define MCL_70_RL78F2X_TAU_TMR_MD0 ((uint16)0x0001U) /* select MDmn0 */

#define MCL_70_RL78F2X_TAU_TMR_MD1_3_0 ((uint16)0x0000U) /* interval timer mode */
#define MCL_70_RL78F2X_TAU_TMR_MD1_3_1 ((uint16)0x0004U) /* capture mode */
#define MCL_70_RL78F2X_TAU_TMR_MD1_3_2 ((uint16)0x0006U) /* event counter mode */
#define MCL_70_RL78F2X_TAU_TMR_MD1_3_3 ((uint16)0x0008U) /* one count mode */
#define MCL_70_RL78F2X_TAU_TMR_MD1_3_4 ((uint16)0x000CU) /* capture & one count mode */

/* data for TS register */
#define MCL_70_RL78F2X_TAU_TS_TS0 ((uint16)0x0001U)     /* start Ch0 */
#define MCL_70_RL78F2X_TAU_TS_TS1 ((uint16)0x0002U)     /* start Ch1 */
#define MCL_70_RL78F2X_TAU_TS_TS2 ((uint16)0x0004U)     /* start Ch2 */
#define MCL_70_RL78F2X_TAU_TS_TS3 ((uint16)0x0008U)     /* start Ch3 */
#define MCL_70_RL78F2X_TAU_TS_TS4 ((uint16)0x0010U)     /* start Ch4 */
#define MCL_70_RL78F2X_TAU_TS_TS5 ((uint16)0x0020U)     /* start Ch5 */
#define MCL_70_RL78F2X_TAU_TS_TS6 ((uint16)0x0040U)     /* start Ch6 */
#define MCL_70_RL78F2X_TAU_TS_TS7 ((uint16)0x0080U)     /* start Ch7 */
#define MCL_70_RL78F2X_TAU_TS_TS_MASK ((uint16)0x0001U) /* TSm bit mask */

/* data for TT register */
#define MCL_70_RL78F2X_TAU_TT_TT0 ((uint16)0x0001U)     /* stop Ch0 */
#define MCL_70_RL78F2X_TAU_TT_TT1 ((uint16)0x0002U)     /* stop Ch1 */
#define MCL_70_RL78F2X_TAU_TT_TT2 ((uint16)0x0004U)     /* stop Ch2 */
#define MCL_70_RL78F2X_TAU_TT_TT3 ((uint16)0x0008U)     /* stop Ch3 */
#define MCL_70_RL78F2X_TAU_TT_TT4 ((uint16)0x0010U)     /* stop Ch4 */
#define MCL_70_RL78F2X_TAU_TT_TT5 ((uint16)0x0020U)     /* stop Ch5 */
#define MCL_70_RL78F2X_TAU_TT_TT6 ((uint16)0x0040U)     /* stop Ch6 */
#define MCL_70_RL78F2X_TAU_TT_TT7 ((uint16)0x0080U)     /* stop Ch7 */
#define MCL_70_RL78F2X_TAU_TT_TT_MASK ((uint16)0x0001U) /* TTm bit mask */

/* data for TCR register */
#define MCL_70_RL78F2X_TAU_TCR_INIT ((uint16)0xFFFFU) /* default value */

/* data for TDR register */
#define MCL_70_RL78F2X_TAU_TDR_INIT ((uint16)0x0000U) /* default value */

/* data for TIS0 register */
#define MCL_70_RL78F2X_TIS0_TIS07 ((uint8)0x80U)
#define MCL_70_RL78F2X_TIS0_TIS06 ((uint8)0x40U)
#define MCL_70_RL78F2X_TIS0_TIS04 ((uint8)0x10U)
#define MCL_70_RL78F2X_TIS0_TIS02 ((uint8)0x04U)
#define MCL_70_RL78F2X_TIS0_TIS01 ((uint8)0x02U)
#define MCL_70_RL78F2X_TIS0_TIS00 ((uint8)0x01U)
#define MCL_70_RL78F2X_TIS0_INIT ((uint8)0x00U) /* default value */

/*----------------------------------------------------------------------------*/
/* for TRJ                                                                    */
/*----------------------------------------------------------------------------*/

/* continuous address registers */
typedef struct
{
    volatile uint8 regTrjCr;  /* 0x0000 : TRJCRx  */
    volatile uint8 regTrjIoc; /* 0x0001 : TRJIOCx */
    volatile uint8 regTrjMr;  /* 0x0002 : TRJMRx  */
    volatile uint8 regTrjSr;  /* 0x0003 : TRJSRx  */
} Mcl_70_RL78F2X_TRJ_ContRegType;

/* top address of TRJ continuous address registers */
#define MCL_70_RL78F2X_TRJ_TRJ00_CONT_ADR (IO8(0x0240U)) /* TRJ Unit0 Ch0 TRJCR */

/* address of TRJ register */
#define MCL_70_RL78F2X_TRJ_TRJ00_ADR (IO16(0x06F0U)) /* TRJ Unit0 Ch0 TRJ */

/* data for TRJMR register */
#define MCL_70_RL78F2X_TRJ_TRJMR_TCK_FCLK ((uint8)0x00U)  /* TRJ TRJMR select fCLK */
#define MCL_70_RL78F2X_TRJ_TRJMR_TCK_FCLK8 ((uint8)0x10U) /* TRJ TRJMR select fCLK/8 */
#define MCL_70_RL78F2X_TRJ_TRJMR_TCK_FCLK2 ((uint8)0x30U) /* TRJ TRJMR select fCLK/2 */
#define MCL_70_RL78F2X_TRJ_TRJMR_TCK_FIL ((uint8)0x40U)   /* TRJ TRJMR select fIL */
#define MCL_70_RL78F2X_TRJ_TRJMR_TCK_ECL ((uint8)0x50U)   /* TRJ TRJMR select ECL event */
#define MCL_70_RL78F2X_TRJ_TRJMR_TCK_FSL ((uint8)0x60U)   /* TRJ TRJMR select fSL */
#define MCL_70_RL78F2X_TRJ_TRJMR_INIT ((uint8)0x00U)      /* default value */

/* data for TRJCR register */
#define MCL_70_RL78F2X_TRJ_TRJCR_TSTART ((uint8)0x01U) /* Set TSTART bit */
#define MCL_70_RL78F2X_TRJ_TRJCR_TCSTF ((uint8)0x02U)  /* Check TCSTF flag */
#define MCL_70_RL78F2X_TRJ_TRJCR_INIT ((uint8)0x00U)   /* default value */

/* data for TRJ register */
#define MCL_70_RL78F2X_TRJ_TRJ_INIT ((uint16)0xFFFFU) /* default value */

/*----------------------------------------------------------------------------*/
/* for TRD                                                                    */
/*----------------------------------------------------------------------------*/

/* continuous address registers */
typedef struct
{
    volatile uint8 regTrdCr;   /* 0x0000 : TRDCRi */
    volatile uint8 regTrdIora; /* 0x0001 : TRDIORAi (no use) */
    volatile uint8 regTrdIorc; /* 0x0002 : TRDIORCi (no use) */
    volatile uint8 regTrdSr;   /* 0x0003 : TRDSRi (no use) */
    volatile uint8 regTrdIer;  /* 0x0004 : TRDIERi (no use) */
    volatile uint8 regTrdPocr; /* 0x0005 : TRDPOCRi (no use) */
    volatile uint16 regTrd;    /* 0x0006 : TRDi */
    volatile uint16 regTrdGra; /* 0x0008 : TRDGRAi */
    volatile uint16 regTrdGrb; /* 0x000A : TRDGRBi (no use) */
    volatile uint16 regTrdGrc; /* 0x0008 : TRDGRAi */
    volatile uint16 regTrdGrd; /* 0x000A : TRDGRBi (no use) */
} Mcl_70_RL78F2X_TRD_ContRegType;

/* fixed address registers */
typedef struct
{
    volatile uint8 regTrdElc;  /* 0x0000 : TRDELC (no use) */
    volatile uint8 dummy[2];   /* 0x0001 - 0x0002 */
    volatile uint8 regTrdStr;  /* 0x0003 : TRDSTR */
    volatile uint8 regTrdMr;   /* 0x0004 : TRDMR */
    volatile uint8 regTrdPmr;  /* 0x0005 : TRDPMR (no use) */
    volatile uint8 regTrdFcr;  /* 0x0006 : TRDFCR */
    volatile uint8 regTrdOer1; /* 0x0007 : TRDOER1 (no use) */
    volatile uint8 regTrdOer2; /* 0x0008 : TRDOER2 (no use) */
    volatile uint8 regTrdOcr;  /* 0x0009 : TRDOCR (no use) */
} Mcl_70_RL78F2X_TRD_FixRegType;

/* top address of TRD continuous address registers */
#define MCL_70_RL78F2X_TRD_TRD00_CONT_ADR (IO16(0x0260U)) /* TRD Unit0 TRDCR0 */
#define MCL_70_RL78F2X_TRD_TRD01_CONT_ADR (IO16(0x0270U)) /* TRD Unit0 TRDCR1 */

/* top address of TRD fixed address registers */
#define MCL_70_RL78F2X_TRD_TRD0_FIX_ADR (IO16(0x0250U)) /* TRD Unit0 TRDELC */

