NguyenPhiHao/RL78F25/Sample_App_Lin/QINeS_MCAL/src/Product_depend/F24/CCRL/Mcal/Platform/include/Mcl_70_RL78F2X.h
#define MCL_70_RL78F2X_TRD_TRDDF0_ADR (IO8(0x025AU)) /* TRD0 TRDDF0 */
#define MCL_70_RL78F2X_TRD_TRDDF1_ADR (IO8(0x025BU)) /* TRD1 TRDDF1 */

/* data for TRDFCR register */
#define MCL_70_RL78F2X_TRD_TRDFCR_VAL ((uint8)0x80U)  /* TRD Unit0 TRDFCR PWM3=1, other bits = 0 */
#define MCL_70_RL78F2X_TRD_TRDFCR_INIT ((uint8)0x80U) /* default value */

/* data for TRDMR register */
#define MCL_70_RL78F2X_TRD_TRDMR_TRDBFCD_MASK ((uint8)0x30U) /* TRD Unit0 TRDMR TRDMFDi, TRDBFCi bit */
#define MCL_70_RL78F2X_TRD_TRDMR_TRDSYNC_MASK ((uint8)0x01U) /* TRD Unit0 TRDMR TRDSYNC bit (this bit has no shift) */
#define MCL_70_RL78F2X_TRD_TRDMR_INIT ((uint8)0x00U)         /* default value */

/* data for TRDCR register */
#define MCL_70_RL78F2X_TRD_TRDCR_TCK_FTRD ((uint8)0x20U)   /* TRDCR select fTRD */
#define MCL_70_RL78F2X_TRD_TRDCR_TCK_FTRD2 ((uint8)0x21U)  /* TRDCR select fTRD/2 */
#define MCL_70_RL78F2X_TRD_TRDCR_TCK_FTRD4 ((uint8)0x22U)  /* TRDCR select fTRD/4 */
#define MCL_70_RL78F2X_TRD_TRDCR_TCK_FTRD8 ((uint8)0x23U)  /* TRDCR select fTRD/8 */
#define MCL_70_RL78F2X_TRD_TRDCR_TCK_FTRD32 ((uint8)0x24U) /* TRDCR select fTRD/32 */
#define MCL_70_RL78F2X_TRD_TRDCR_TCK_TRDCLK ((uint8)0x25U) /* TRDCR select TRDCLK */
#define MCL_70_RL78F2X_TRD_TRDCR_INIT ((uint8)0x00U)       /* default value */

/* data for TRDSTR register */
#define MCL_70_RL78F2X_TRD_TRDSTR_CSEL_MASK ((uint8)0x04U)   /* TRD Unit0 TRDSTR CSELi bit mask */
#define MCL_70_RL78F2X_TRD_TRDSTR_TSTART_MASK ((uint8)0x01U) /* TRD Unit0 TRDSTR TSTARTi bit mask */
#define MCL_70_RL78F2X_TRD_TRDSTR_INIT ((uint8)0x0CU)        /* default value */

/* data for TRDSRi register */
#define MCL_70_RL78F2X_TRD_TRDSR_IMFA_MASK ((uint8)0x01U) /* IMFA bit mask */
#define MCL_70_RL78F2X_TRD_TRDSR_INIT ((uint8)0x00U)      /* default value */

/* data for TRDIERi register */
#define MCL_70_RL78F2X_TRD_TRDIER_IMIEA_MASK ((uint8)0x01U) /* IMIEA bit mask */
#define MCL_70_RL78F2X_TRD_TRDIER_INIT ((uint8)0x00U)       /* default value */

/* data for TRDi register */
#define MCL_70_RL78F2X_TRD_TRD_INIT ((uint16)0x0000U) /* default value */

/* data for TRDGRAi register */
#define MCL_70_RL78F2X_TRD_TRDGRA_INIT ((uint16)0xFFFFU) /* default value */

/*----------------------------------------------------------------------------*/
/* for Port                                                                   */
/*----------------------------------------------------------------------------*/
/* Port register address */
#define PORT_70_RL78F2X_P_ADR (0xff00U)
#define PORT_70_RL78F2X_PITHL_ADR (0x0020U)
#define PORT_70_RL78F2X_PU_ADR (0x0030U)
#define PORT_70_RL78F2X_PIM_ADR (0x0040U)
#define PORT_70_RL78F2X_POM_ADR (0x0050U)
#define PORT_70_RL78F2X_PMC_ADR (0x0060U)
#define PORT_70_RL78F2X_PM_ADR (0xff20U)
#define PORT_70_RL78F2X_PMS_ADR (0x0077U)
#define PORT_70_RL78F2X_PSRSEL_ADR (0x0220U)

/* PIORx register address */
#define PORT_70_RL78F2X_PIOR00_ADR (0x0016U)
#define PORT_70_RL78F2X_PIOR01_ADR (0x0017U)
#define PORT_70_RL78F2X_PIOR02_ADR (0x0018U)
#define PORT_70_RL78F2X_PIOR03_ADR (0x0019U)
#define PORT_70_RL78F2X_PIOR04_ADR (0x001AU)
#define PORT_70_RL78F2X_PIOR05_ADR (0x001BU)
#define PORT_70_RL78F2X_PIOR06_ADR (0x001CU)
#define PORT_70_RL78F2X_PIOR07_ADR (0x001DU)
#define PORT_70_RL78F2X_PIOR08_ADR (0x001EU)

/* Port control register address */
#define PORT_70_RL78F2X_Px(i) (PORT_70_RL78F2X_P_ADR + (0x01U * (i)))
#define PORT_70_RL78F2X_PMx(i) (PORT_70_RL78F2X_PM_ADR + (0x01U * (i)))

/* Defined for DIO. Because of using the size of "Dio_PortType" for abstraction */
#define PORT_70_RL78F2X_DIO_Px(i) (PORT_70_RL78F2X_P_ADR + ((uint16)(sizeof(Dio_PortType)) * (i)))

/*----------------------------------------------------------------------------*/
/* for Interrupt                                                              */
/*----------------------------------------------------------------------------*/
#define MCL_70_RL78F2X_INT_INTMSK_ADR (IO8(0x007CU)) /* Interrupt Mask Register */
#define MCL_70_RL78F2X_INT_EGP0_ADR (IO8(0xFF38U))   /* Interrupt EGP0 Register */
#define MCL_70_RL78F2X_INT_EGN0_ADR (IO8(0xFF39U))   /* Interrupt EGN0 Register */
#define MCL_70_RL78F2X_INT_EGP1_ADR (IO8(0xFF3AU))   /* Interrupt EGP1 Register */
#define MCL_70_RL78F2X_INT_EGN1_ADR (IO8(0xFF3BU))   /* Interrupt EGN1 Register */

/*----------------------------------------------------------------------------*/
/* for ELC                                                                    */
/*----------------------------------------------------------------------------*/
typedef struct
{
    volatile uint8 regElselr[26]; /* 0x0000 - 0x0025 */
} Mcl_70_RL78F2X_ELC_FixRegType;

/* top address of ELC fixed address registers */
#define MCL_70_RL78F2X_ELC_FIX_ADR (IO8(0x0780U)) /* ELC ELSELR00 */

/* index of ELC ELSELR** registers */
#define MCL_70_RL78F2X_ELC_ELSELR_INTP0 (0U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTP1 (1U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTP2 (2U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTP3 (3U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTP4 (4U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTP5 (5U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTKR (6U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTRTC (7U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTRD0A (8U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTRD0B (9U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTRD1A (10U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTRD1B (11U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTRDUF (12U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTRJ0 (13U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTM00 (14U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTM01 (15U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTM02 (16U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTM03 (17U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTM04 (18U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTCMP0 (19U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTM05 (20U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTM06 (21U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTM07 (22U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTM10 (23U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTM11 (24U)
#define MCL_70_RL78F2X_ELC_ELSELR_INTTM12 (25U)
/* number of ELC ELSELR** registers */
#define MCL_70_RL78F2X_ELC_ELSELR_NUM (26U)

/* bit field of ELC ELSELR** registers */
#define MCL_70_RL78F2X_ELC_ELSELR_NONE (0x00U)
#define MCL_70_RL78F2X_ELC_ELSELR_ADC (0x01U)
#define MCL_70_RL78F2X_ELC_ELSELR_TAU00 (0x02U)
#define MCL_70_RL78F2X_ELC_ELSELR_TAU01 (0x03U)
#define MCL_70_RL78F2X_ELC_ELSELR_TRJ0 (0x04U)
#define MCL_70_RL78F2X_ELC_ELSELR_TRD0 (0x05U)
#define MCL_70_RL78F2X_ELC_ELSELR_TRD1 (0x06U)
#define MCL_70_RL78F2X_ELC_ELSELR_DA0 (0x07U)
#define MCL_70_RL78F2X_ELC_ELSELR_TAU02 (0x08U)
#define MCL_70_RL78F2X_ELC_ELSELR_TAU03 (0x09U)

/*----------------------------------------------------------------------------*/
/* function prototype declarations for IAR Built-in Function                  */
/*----------------------------------------------------------------------------*/
extern void __halt(void);
extern void __stop(void);
extern void QL_70_NEAR __set1(uint8 QL_70_NEAR *X, uint8 Y);
extern void QL_70_NEAR __clr1(uint8 QL_70_NEAR *X, uint8 Y);
extern void QL_70_NEAR __not1(uint8 QL_70_NEAR *X, uint8 Y);

#endif /* #ifndef MCL_70_RL78F2X_H_ */

/* EOF MCL_70_RL78F2X.h *******************************************************/
